photo_urls = {
   'mortal_combat': 'https://dungen.ru/wp-content/uploads/2019/04/scorpion-1547752418423.jpg',
   'street_fighter': 'https://gameguru.ru/media/f/wallpapers/3/1/45/39/2560.jpg',
   'crusader_kings': 'https://cq.ru/storage/uploads/posts/1122030/1.jpeg',
   'civilization': 'https://i.pinimg.com/originals/e6/4d/9b/e64d9b110a3073b2153964f1465c869f.jpg',
   'skyrim': 'https://mobimg.b-cdn.net/v3/fetch/27/27c96940e256d7b6ce7bb1534efb46a3.jpeg',
   'warcraft': 'https://avatars.dzeninfra.ru/get-zen_doc/3530293/pub_60c9e66853530700cdeaadfd_60ca26698df8dd3fc9de21f7/scale_1200',
   'cities_skylines': 'https://droidnews.ru/img/2022/november/oprobujte-besplatno-cities-skylines-v-steam_12-11-22-14-53-18.jpg',
   'minecraft': 'https://secinfinity.net/wp-content/uploads/2019/09/Gut-gepflegt-Minecraft-wird-monatlich-von-112-Millionen-Spielern-gespielt.jpg',
   'gta': 'https://blog.zh-hant.playstation.com/tachyon/sites/8/2021/09/48230f00cac67ad29fc2f9ee536d890100fa31a3-scaled.jpg',
   'rdr': 'https://www.digiseller.ru/preview/1031507/p1_3244470_cb011158.jpg'
}


game_descriptions = {
   'mortal_combat': 'Mortal Kombat — культовая серия файтингов, в которых два игрока пытаются одолеть друг друга в '
                    'рукопашном бою. Обычно матч проходит в два этапа, в ходе которых игроки пытаются опустошить полоску'
                    ' жизни противника, а потом эффектно добить его. В ход идут и серии простых ударов, и замысловатые '
                    'комбо: если выучить правильные комбинации кнопок, то можно проводить длинные '
                    'комбинации, срезая здоровье оппонента сразу на треть.',
   'street_fighter': 'Street Fighter 5 - это аркадный файтинг, разработанный Capcom. Игроки выбирают одного из '
                     'множества бойцов и сражаются в одиночных или сетевых боях. Игра включает разнообразные комбо-атаки, '
                     'специальные приемы и ультра-комбо, позволяющие игрокам проявить свои навыки и стратегии. Street '
                     'Fighter 5 предлагает глубокую механику боя и яркую графику, делая ее одной из популярных игр в '
                     'жанре файтингов.',
   'crusader_kings': 'Crusader Kings 3 - это глубокая и комплексная стратегическая игра, где игроки в роли правителя '
                     'управляют династией, принимают политические решения, вступают в дипломатические отношения, ведут '
                     'войну и развивают свои владения в течение средневековой эпохи. Игра предлагает множество '
                     'возможностей для стратегического планирования, создания союзов, управления семейными связями и '
                     'влиянием на мир вокруг вас.',
   'civilization': 'Civilization 6 - это пошаговая стратегическая игра, разработанная Firaxis Games. Игроки принимают '
                   'роль лидера цивилизации и строят свою империю, начиная с древности и продвигаясь вплоть до '
                   'современности и будущего. Цель игры - развитие городов, исследование новых технологий, управление '
                   'ресурсами, дипломатия и ведение войн.',
   'skyrim': 'The Elder Scrolls V: Skyrim - это открытый мир фэнтезийной ролевой игры. Игроки погружаются в прекрасно '
             'воссозданный мир Скайрима и взлетают в роли Довакина - героя с драконьими способностями. Игра предлагает '
             'свободу исследования, выполнение заданий, развитие навыков, сражение с врагами и драконами.',
   'warcraft': 'World of Warcraft (WoW) - это массовая многопользовательская онлайн-игра, разработанная Blizzard '
               'Entertainment. Игроки погружаются в фэнтезийный мир Азерота, где они могут выбрать одну из различных '
               'рас и классов персонажей. Целью игры является исследование огромного открытого мира, выполнение '
               'заданий, сражение с монстрами и другими игроками, а также развитие своего персонажа. WoW предлагает '
               'глубокую систему прогрессии, социальное взаимодействие, эпические события и PvP-сражения. Игра также '
               'имеет множество расширений, добавляющих новые зоны, рейды и контент для игроков.',
   'cities_skylines': 'Cities: Skylines - это симулятор градостроительства, разработанный Colossal Order. В игре игроки '
                      'получают возможность создавать и управлять своим собственным городом. Они могут строить дороги, '
                      'зоны жилья, коммерческие и промышленные районы, а также обеспечивать город инфраструктурой, '
                      'услугами и удовлетворением потребностей жителей. Игра предлагает глубокую систему планирования '
                      'и развития, управление экономикой, транспортом и экологией, а также множество модификаций и '
                      'контента, позволяющих создавать уникальные города.',
   'minecraft': 'Minecraft - это песочница и выживание в открытом мире, разработанная Mojang Studios. '
                'В игре игроки исследуют генерируемый случайным образом мир, добывают ресурсы, создают и '
                'строят различные блоки и предметы. Они могут выживать, сражаться с монстрами, обрабатывать землю, '
                'разводить животных и взаимодействовать с другими игроками в режиме многопользовательской игры. '
                'Minecraft предлагает неограниченные возможности для творчества, строительства и приключений, а также '
                'множество модификаций и режимов игры, расширяющих игровой опыт.',
   'gta': 'GTA 5 (Grand Theft Auto V) - это игра в жанре экшн-приключение с открытым миром, разработанная Rockstar'
          ' North. Игроки погружаются в виртуальный город Лос-Сантос и играют за три разных персонажа. Игра предлагает '
          'свободу действий, где игроки могут выполнять различные миссии, участвовать в ограблениях, взаимодействовать '
          'с окружающим миром и взрывать хаос. GTA 5 также предлагает множество возможностей для исследования, '
          'вождения автомобилей, полетов на самолетах и множество других активностей в огромном и '
          'детализированном мире игры.',
   'rdr': 'Red Dead Redemption 2 - это приключенческая игра с открытым миром, разработанная Rockstar Games. '
          'Игроки отправляются в американский Дикий Запад конца 19 века и играют за Артура Моргана, '
          'члена банды Ван Дер Линдов. Игра предлагает захватывающий сюжет, открытый мир для исследования, '
          'множество миссий и заданий, взаимодействие с животными и окружающей средой, а также возможность '
          'принимать моральные выборы, влияющие на развитие сюжета. Red Dead Redemption 2 предлагает глубокий и '
          'реалистичный опыт жизни в Диком Западе, с удивительной графикой и великолепной атмосферой.'
}


game_titles = {'mortal_combat': 'Mortal Combat 11', 'street_fighter': 'Street fighter 5',
               'crusader_kings': 'Crusader Kings 3', 'civilization': 'The Civilization VI',
               'skyrim': 'The Elder Scrolls V: Skyrim', 'warcraft': 'World of Warcraft',
               'cities_skylines': 'Cities Skylines', 'minecraft': 'Minecraft',
               'gta': 'Grand theft Auto V', 'rdr': 'Red Dead Redemption 2'}